  const diaryData = {
    
    "2026/09/29": [
      {
        title: "タイトル機能テスト",
        time: "09:21",
        text: `(*‘ω‘ *)(*‘ω‘ *)(*‘ω‘ *)(*‘ω‘ *)(*‘ω‘ *)(*‘ω‘ *)`
      },
      {
        time: "02:32",
        text: `時計、写真、カウンター機能を追加した！
        あとコードの話だけどindexに直接書き込んでいたのを各機能ごとにファイルを作って分かりやすくした！
        えらい！！(*´σｰ｀)ｴﾍﾍ
        `
      },
      {
        time: "01:12",
        text: `窓開けたら後ろの家が葬式やってた。
        本来なかった灯かりで辺りが照らされていて何百回も見た光景なのに妙な新鮮味を感じる。毎日やっててほしい⊂⌒~⊃｡Д｡)⊃
        なんかこういう文章書いてると太ももが釣りそうになる
        `
      },
    ],

    "2026/09/28": [
        
      {
        time: "19:43",
        text: `表示テスト(*‘ω‘ *)
               `
      },
      {
        time: "19:26",
        text: `ホームページ作ったヨ！(^^)/

               作った（大嘘）本当はchatGPTに丸投げして寝かせたら勝手にできていた。
               社会人時代に覚えた技術を活かして一から作りたかったが、技量も知識も枯れていた。元々なかったのかもしれない。
               このサイトを公開して眠りについたら会社の奴らにリンチされる夢を見た。
               ゲームでもして現実逃避します。
           
               ε=ε=(＃＞Д＜)ｺﾗｰε=ε=(*≧∇)ｷｬｰ
               `
      },
    ],

    "2026/09/27": [
      {
        time: "00:00",
        text: `前日が表示されるかテスト(*‘ω‘ *)`
      },
    ],
  };