  const diaryData = {
    
    "2026/09/28": [
        
      {
        time: "19:43",
        text: `表示テスト(*‘ω‘ *)
               `
      },
      {
        time: "19:26",
        text: `ホームページ作ったヨ！(^^)/

               作った（大嘘）本当はchatGPTに丸投げして寝かせたら勝手にできていた。
               社会人時代に覚えた技術を活かして一から作りたかったが、技量も知識も枯れていた。元々なかったのかもしれない。
               このサイトを公開して眠りについたら会社の奴らにボコられる夢を見た。
               ゲームでもして現実逃避します。
           
               ε=ε=(＃＞Д＜)ｺﾗｰε=ε=(*≧∇)ｷｬｰ
               `
      },
    ],

    "2026/09/27": [
      {
        time: "00:00",
        text: `前日が表示されるかテスト(*‘ω‘ *)`
      },
    ],
  };