  const diaryData = {
    "2026/10/02": [
      {
        title: "器",
        time: "03:42",
        text: `メルカリで腕時計買おうと思って見てたら、腕時計専門のアカウントで状態が"目立った傷や汚れ無し"の表記で安価のいい商品を見つけた。
        けど掲載されてる画像を見たら防風に傷っぽい跡があったから、画像も荒かったしノイズかもしれないと思って、
        「状態を確認したいので別角度からの写真を追加してほしい」との旨のコメントを書いたら、出品者にコメントを削除された上に「ご検討ください。」って返信された。
        一連の流れから、傷はあるけどわざと画像を荒くして”目立った傷や汚れ無し”の表記で商品を販売しようとした上に印象が悪くなるから俺のコメントを削除してその上、あたかも普通に返信したように更に隠蔽を重ねたって事だよね。
        なんか悔しいからもう一回同じコメント書いた。
        お返事待ってまーす。（國母和宏）
        `
      },
      {
        title: "ゲーセン",
        time: "01:17",
        text: `ガンダム遊んでるヤツら声でかすぎ！！奇声！！本当に動物園みたいでした！！🐂🐇🐅🐘🐐🐄🐖🐪←コイツら！！
        おかげさまで「ガイジ」とか「障害」とか日常ではまず聞けない言葉を、おっっきな声でいっぱい聞けました♪♪♪
        麻雀やってたんだけど、奇声の度に頭が真っ白になって何の役狙ってたかまじで分からなくなった。（白すぎてハクでポン…？とか思った）
        もう来ないでほしい( ﾉД\`)ｼｸｼｸ…

        あとオーラス最下位で、国士無双あと一手でテンパイの状態まで持ってったのに、北でカンされて詰んだ。悲しい。
        🀇🀏🀔🀗🀘🀙🀡🀀🀁🀂🀆🀅🀄（その時の無慈悲な手牌）
        `
      },
    ],

    "2026/09/30": [
      {
        title: "労働2",
        time: "21:06",
        text: `さっき応募した会社から連絡があって、ついに労働が始まるみたい
        病院って本当にお局いるのかな、居てもいじめないでね(;O;)
        てか普通に起きれる気がしない Σ(￣ロ￣lll)ｶﾞｰﾝ
        `
      },
      {
        title: "労働",
        time: "02:05",
        text: `ハロワで職員に武勇伝語ってるじじいが居た。
        結構どうでも良かったけど、ああいう奴ほど長生きするみたいな風潮あるよね。
        後ここ2、3日「朝と夜が逆の暮らしを続けて♪（竹内まりや）」るから直さないと思ったけど、予定なにも無いし別にいっか(^^♪
        早く働きたい。
        　　　　　　　　 __
　　　　　　　〈/⌒ヽ
　　　　　 　r个 ､: :!
　　　　　　/ ﾊヾ　r'
　　　　　〈/ 　 　 |
　　　 　 /　　　　.}
　　　　 /! 　 　 /
　　　　 { ﾐ　　 ,
　　　　Vﾐ　　 ﾊ
　　　＞､　〃　ヽ. '
　 /　　｀/´　　 　ヽ
　 {　　　{.　　　　　 }
　 ヽ＿_.ヽ　＿＿ノ
        `
      },
    ],
    "2026/09/29": [
      {
        title: "タイトル機能テスト",
        time: "09:21",
        text: `(*‘ω‘ *)(*‘ω‘ *)(*‘ω‘ *)(*‘ω‘ *)(*‘ω‘ *)(*‘ω‘ *)`
      },
      {
        time: "02:32",
        text: `時計、写真、カウンター機能を追加した！
        あとコードの話だけどindexに直接書き込んでいたのを各機能ごとにファイルを作って分かりやすくした！
        えらい！！(*´σｰ｀)ｴﾍﾍ
        `
      },
      {
        time: "01:12",
        text: `窓開けたら後ろの家が葬式やってた。
        本来なかった灯かりで辺りが照らされていて何百回も見た光景なのに妙な新鮮味を感じる。毎日やっててほしい⊂⌒~⊃｡Д｡)⊃
        なんかこういう文章書いてると太ももが釣りそうになる
        `
      },
    ],

    "2026/09/28": [
        
      {
        time: "19:43",
        text: `表示テスト(*‘ω‘ *)
               `
      },
      {
        time: "19:26",
        text: `ホームページ作ったヨ！(^^)/

               作った（大嘘）本当はchatGPTに丸投げして寝かせたら勝手にできていた。
               社会人時代に覚えた技術を活かして一から作りたかったが、技量も知識も枯れていた。元々なかったのかもしれない。
               このサイトを公開して眠りについたら会社の奴らにリンチされる夢を見た。
               ゲームでもして現実逃避します。
           
               ε=ε=(＃＞Д＜)ｺﾗｰε=ε=(*≧∇)ｷｬｰ
               `
      },
    ],

    "2026/09/27": [
      {
        time: "00:00",
        text: `前日が表示されるかテスト(*‘ω‘ *)`
      },
    ],
  };